RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_ll_rcc.c
  /* PLL_VCO = (HSE_VALUE, CSI_VALUE or HSI_VALUE/HSIDIV) / PLLM * (PLLN + FRACN)
     SYSCLK = PLL_VCO / PLLP
  */
  pllsource = LL_RCC_PLL_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLLSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        if (LL_RCC_HSI_IsDividerReady() != 0U)
        {
          pllinputfreq = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_CR_HSIDIV_Pos);
        }
      }
      break;

    case LL_RCC_PLLSOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        pllinputfreq = CSI_VALUE;
      }
      break;

    case LL_RCC_PLLSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        pllinputfreq = HSE_VALUE;
      }
      break;

    case LL_RCC_PLLSOURCE_NONE:
    default:
      /* PLL clock disabled */
      break;
  }

  PLL_Clocks->PLL_P_Frequency = 0U;
  PLL_Clocks->PLL_Q_Frequency = 0U;
  PLL_Clocks->PLL_R_Frequency = 0U;
  PLL_Clocks->PLL_S_Frequency = 0U;
  PLL_Clocks->PLL_T_Frequency = 0U;

  m = LL_RCC_PLL2_GetM();
  n = LL_RCC_PLL2_GetN();
  if (LL_RCC_PLL2FRACN_IsEnabled() != 0U)
  {
    fracn = LL_RCC_PLL2_GetFRACN();
  }

  if (m != 0U)
  {
    if (LL_RCC_PLL2P_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_P_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL2_GetP());
    }

    if (LL_RCC_PLL2Q_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_Q_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL2_GetQ());
    }

    if (LL_RCC_PLL2R_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_R_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL2_GetR());
    }

    if (LL_RCC_PLL2S_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_S_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL2_GetS());
    }

    if (LL_RCC_PLL2T_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_T_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL2_GetT());
    }
  }
}

/**
  * @brief  Return PLL3 clocks frequencies
  * @note   LL_RCC_PERIPH_FREQUENCY_NO returned for non activated output or oscillator not ready
  * @retval None
  */
void LL_RCC_GetPLL3ClockFreq(LL_PLL_ClocksTypeDef *PLL_Clocks)
{
  uint32_t pllinputfreq = LL_RCC_PERIPH_FREQUENCY_NO;
  uint32_t pllsource;
  uint32_t m;
  uint32_t n;
  uint32_t fracn = 0U;

  /* PLL_VCO = (HSE_VALUE, CSI_VALUE or HSI_VALUE/HSIDIV) / PLLM * (PLLN + FRACN)
     SYSCLK = PLL_VCO / PLLP
  */
  pllsource = LL_RCC_PLL_GetSource();

  switch (pllsource)
  {
    case LL_RCC_PLLSOURCE_HSI:
      if (LL_RCC_HSI_IsReady() != 0U)
      {
        if (LL_RCC_HSI_IsDividerReady() != 0U)
        {
          pllinputfreq = HSI_VALUE >> (LL_RCC_HSI_GetDivider() >> RCC_CR_HSIDIV_Pos);
        }
      }
      break;

    case LL_RCC_PLLSOURCE_CSI:
      if (LL_RCC_CSI_IsReady() != 0U)
      {
        pllinputfreq = CSI_VALUE;
      }
      break;

    case LL_RCC_PLLSOURCE_HSE:
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        pllinputfreq = HSE_VALUE;
      }
      break;

    case LL_RCC_PLLSOURCE_NONE:
    default:
      /* PLL clock disabled */
      break;
  }

  PLL_Clocks->PLL_P_Frequency = 0U;
  PLL_Clocks->PLL_Q_Frequency = 0U;
  PLL_Clocks->PLL_R_Frequency = 0U;
  PLL_Clocks->PLL_S_Frequency = 0U;
  PLL_Clocks->PLL_T_Frequency = 0U;

  m = LL_RCC_PLL3_GetM();
  n = LL_RCC_PLL3_GetN();
  if (LL_RCC_PLL3FRACN_IsEnabled() != 0U)
  {
    fracn = LL_RCC_PLL3_GetFRACN();
  }

  if ((m != 0U) && (pllinputfreq != 0U))
  {
    if (LL_RCC_PLL3P_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_P_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL3_GetP());
    }

    if (LL_RCC_PLL3Q_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_Q_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL3_GetQ());
    }

    if (LL_RCC_PLL3R_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_R_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL3_GetR());
    }

    if (LL_RCC_PLL3S_IsEnabled() != 0U)
    {
      PLL_Clocks->PLL_S_Frequency = LL_RCC_CalcPLLClockFreq(pllinputfreq, m, n, fracn, LL_RCC_PLL3_GetS());
    }
  }
}

/**
  * @brief  Configure Spread Spectrum used for PLL1
  * @note These bits must be written before enabling PLL1
  * @note MODPER x INCSTEP shall not exceed 2^15-1
  * @rmtoll PLL1SSCGR    MODPER        LL_RCC_PLL1_ConfigSpreadSpectrum\n
  *         PLL1SSCGR    INCSTEP       LL_RCC_PLL1_ConfigSpreadSpectrum\n
  *         PLL1SSCGR    SPREADSEL     LL_RCC_PLL1_ConfigSpreadSpectrum\n
  *         PLL1SSCGR    TPDFNDIS      LL_RCC_PLL1_ConfigSpreadSpectrum\n
  *         PLL1SSCGR    RPDFNDIS      LL_RCC_PLL1_ConfigSpreadSpectrum
  * @param  pConfig Pointer to LL_PLL_SpreadSpectrumTypeDef structure
  * @retval None
  */
void LL_RCC_PLL1_ConfigSpreadSpectrum(const LL_PLL_SpreadSpectrumTypeDef *pConfig)
{
  MODIFY_REG(RCC->PLL1SSCGR, \
             (RCC_PLL1SSCGR_MODPER | RCC_PLL1SSCGR_INCSTEP | RCC_PLL1SSCGR_SPREADSEL | \
              RCC_PLL1SSCGR_TPDFNDIS | RCC_PLL1SSCGR_RPDFNDIS), \
             (pConfig->ModulationPeriod | ((uint32_t)pConfig->IncrementStep << RCC_PLL1SSCGR_INCSTEP_Pos) | \
              pConfig->SpreadMode | pConfig->DitheringTPDFN | pConfig->DitheringRPDFN));
}

/**
  * @brief  Configure Spread Spectrum used for PLL2
  * @note These bits must be written before enabling PLL2
  * @rmtoll PLL2SSCGR    MODPER        LL_RCC_PLL2_ConfigSpreadSpectrum\n
  *         PLL2SSCGR    INCSTEP       LL_RCC_PLL2_ConfigSpreadSpectrum\n
  *         PLL2SSCGR    SPREADSEL     LL_RCC_PLL2_ConfigSpreadSpectrum\n
  *         PLL2SSCGR    TPDFNDIS      LL_RCC_PLL2_ConfigSpreadSpectrum\n
  *         PLL2SSCGR    RPDFNDIS      LL_RCC_PLL2_ConfigSpreadSpectrum
  * @param  pConfig Pointer to LL_PLL_SpreadSpectrumTypeDef structure
  * @retval None
  */
void LL_RCC_PLL2_ConfigSpreadSpectrum(const LL_PLL_SpreadSpectrumTypeDef *pConfig)
{
  MODIFY_REG(RCC->PLL2SSCGR, \
             (RCC_PLL2SSCGR_MODPER | RCC_PLL2SSCGR_INCSTEP | RCC_PLL2SSCGR_SPREADSEL | \
              RCC_PLL2SSCGR_TPDFNDIS | RCC_PLL2SSCGR_RPDFNDIS), \
             (pConfig->ModulationPeriod | ((uint32_t)pConfig->IncrementStep << RCC_PLL2SSCGR_INCSTEP_Pos) | \
              pConfig->SpreadMode | pConfig->DitheringTPDFN | pConfig->DitheringRPDFN));
}

/**
  * @brief  Configure Spread Spectrum used for PLL3
  * @note These bits must be written before enabling PLL3
  * @rmtoll PLL3SSCGR    MODPER        LL_RCC_PLL3_ConfigSpreadSpectrum\n
  *         PLL3SSCGR    INCSTEP       LL_RCC_PLL3_ConfigSpreadSpectrum\n
  *         PLL3SSCGR    SPREADSEL     LL_RCC_PLL3_ConfigSpreadSpectrum\n
  *         PLL3SSCGR    TPDFNDIS      LL_RCC_PLL3_ConfigSpreadSpectrum\n
  *         PLL3SSCGR    RPDFNDIS      LL_RCC_PLL3_ConfigSpreadSpectrum
  * @param  pConfig Pointer to LL_PLL_SpreadSpectrumTypeDef structure
  * @retval None
  */
void LL_RCC_PLL3_ConfigSpreadSpectrum(const LL_PLL_SpreadSpectrumTypeDef *pConfig)
{
  MODIFY_REG(RCC->PLL3SSCGR, \
             (RCC_PLL3SSCGR_MODPER | RCC_PLL3SSCGR_INCSTEP | RCC_PLL3SSCGR_SPREADSEL | \
              RCC_PLL3SSCGR_TPDFNDIS | RCC_PLL3SSCGR_RPDFNDIS), \
             (pConfig->ModulationPeriod | ((uint32_t)pConfig->IncrementStep << RCC_PLL3SSCGR_INCSTEP_Pos) | \
              pConfig->SpreadMode | pConfig->DitheringTPDFN | pConfig->DitheringRPDFN));
}


/**
  * @brief  Return USARTx clock frequency
  * @param  USARTxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USART1_CLKSOURCE
  *         @arg @ref LL_RCC_USART234578_CLKSOURCE
  * @retval USART clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator is not ready
  */
uint32_t LL_RCC_GetUSARTClockFreq(uint32_t USARTxSource)
{
  uint32_t usart_frequency = LL_RCC_PERIPH_FREQUENCY_NO;
  LL_PLL_ClocksTypeDef PLL_Clocks;

  /* Check parameter */
  assert_param(IS_LL_RCC_USART_CLKSOURCE(USARTxSource));

